In [6]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%sql sqlite:///first-database-sql.db

# 1. Products tablosundaki CategoryID'lerin yani kategorilerin isimleri?

In [5]:
%%sql
SELECT CategoryID, ProductName
FROM Products LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Chais'),
 (1, 'Chang'),
 (2, 'Aniseed Syrup'),
 (2, "Chef Anton's Cajun Seasoning"),
 (2, "Chef Anton's Gumbo Mix")]

In [14]:
%%sql
SELECT CategoryID, CategoryName 
FROM Categories LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Beverages'),
 (2, 'Condiments'),
 (3, 'Confections'),
 (4, 'Dairy Products'),
 (5, 'Grains/Cereals')]

In [8]:
%%sql
SELECT * FROM Products 
LEFT JOIN Categories ON Products.CategoryID = Categories.CategoryID LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (1, 'Chais', 1, 1, '10 boxes x 20 bags', 18, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (1, 'Chais', 1, 1, '10 boxes x 20 bags', 18, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (1, 'Chais', 1, 1, '10 boxes x 20 bags', 18, 1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (1, 'Chais', 1, 1, '10 boxes x 20 bags', 18, 1, 'Speedy Express', '(503) 555-9831')]

# 2. Beverages urun kategorisindeki urunlerin fiyat ortlamasi nedir?

In [22]:
%%sql
SELECT * FROM Categories LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Beverages', 'Soft drinks, coffees, teas, beers, and ales'),
 (2, 'Condiments', 'Sweet and savory sauces, relishes, spreads, and seasonings'),
 (3, 'Confections', 'Desserts, candies, and sweet breads'),
 (4, 'Dairy Products', 'Cheeses'),
 (5, 'Grains/Cereals', 'Breads, crackers, pasta, and cereal')]

In [23]:
%%sql
SELECT * FROM Products LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21)]

In [36]:
%%sql
SELECT AVG(Price) 
FROM Products;

 * sqlite:///first-database-sql.db
Done.

[(39.15584415584416,)]

In [35]:
%%sql
SELECT AVG(Price) 
FROM Products 
LEFT JOIN Categories ON Products.CategoryID = categories.CategoryID 
WHERE CategoryName = 'Beverages';

 * sqlite:///first-database-sql.db
Done.

[(42.75,)]

# 3. USA'da yasayan musterilerin kazandirdigi toplam kazanci?

In [44]:
%%sql 
SELECT SUM(p.Price) 
FROM Orders o 
LEFT JOIN OrderDetails od on o.OrderID = od.OrderID 
LEFT JOIN Products p on od.ProductID = p.ProductID 
LEFT JOIN Customers cu on o.CustomerID = cu.CustomerID where cu.Country = 'USA';

 * sqlite:///first-database-sql.db
Done.

[(7524,)]

# 4. Product tablosundaki CategoryID'lerin isimleri ve kategori basina ortalama urun fiyati?

In [11]:
%%sql
SELECT AVG(Price) 
FROM Products 
LEFT JOIN Categories ON Products.CategoryID = Categories.CategoryID 
GROUP BY CategoryName LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(42.75,), (28.25,), (33.76923076923077,), (74.9,), (33.76923076923077,)]

In [47]:
%%sql
SELECT AVG(Price), CategoryName 
FROM Products 
LEFT JOIN Categories ON Products.CategoryID = Categories.CategoryID 
GROUP BY CategoryName LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(42.75, 'Beverages'),
 (28.25, 'Condiments'),
 (33.76923076923077, 'Confections'),
 (74.9, 'Dairy Products'),
 (33.76923076923077, 'Federal Shipping')]

# 5. Çalısanları isimleri ile birlikte yaptıkları toplam satisa gore sirala.

In [15]:
%%sql
SELECT Employees.FirstName, SUM(Products.Price) AS toplam_satis 
FROM Orders 
LEFT JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID 
LEFT JOIN Products ON OrderDetails.ProductID = Products.ProductID 
LEFT JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID 
GROUP BY Orders.EmployeeID 
ORDER BY toplam_satis DESC LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[('Margaret', 11030),
 ('Nancy', 8706),
 ('Janet', 6096),
 ('Michael', 5962),
 ('Laura', 4760)]

In [13]:
%%sql
SELECT em.FirstName, SUM(p.Price) AS toplam_satis 
FROM Orders AS o 
LEFT JOIN OrderDetails AS od ON o.OrderID = od.OrderID 
LEFT JOIN Products AS p ON od.ProductID = p.ProductID 
LEFT JOIN Employees AS em ON o.EmployeeID = em.EmployeeID 
GROUP BY o.EmployeeID 
ORDER BY toplam_satis DESC LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[('Margaret', 11030),
 ('Nancy', 8706),
 ('Janet', 6096),
 ('Michael', 5962),
 ('Laura', 4760)]

In [14]:
%%sql
SELECT em.FirstName, SUM(p.Price) toplam_satis 
FROM Orders o 
LEFT JOIN OrderDetails od ON o.OrderID = od.OrderID 
LEFT JOIN Products p ON od.ProductID = p.ProductID 
LEFT JOIN Employees em ON o.EmployeeID = em.EmployeeID 
GROUP BY o.EmployeeID 
ORDER BY toplam_satis DESC LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[('Margaret', 11030),
 ('Nancy', 8706),
 ('Janet', 6096),
 ('Michael', 5962),
 ('Laura', 4760)]